PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rtc.c
/*!
    \file    gd32f3x0_hal_rtc.c
    \brief   RTC driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"

/*!
    \brief      init RTC
    \param[in]  rtc_dev: RTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  rtc_init: the pointer of RTC calendar configure structure
                  rtc_year: 0~99
                  rtc_month:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_JAN: Janurary
      \arg          RTC_FEB: February
      \arg          RTC_MAR: March
      \arg          RTC_APR: April
      \arg          RTC_MAY: May
      \arg          RTC_JUN: June
      \arg          RTC_JUL: July
      \arg          RTC_AUG: August
      \arg          RTC_SEP: September
      \arg          RTC_OCT: October
      \arg          RTC_NOV: November
      \arg          RTC_DEC: December
                  rtc_date: 0~31
                  rtc_day_of_week:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_MONDAY: Monday
      \arg          RTC_TUESDAY: Tuesday
      \arg          RTC_WEDSDAY: Wednesday
      \arg          RTC_THURSDAY: Thursday
      \arg          RTC_FRIDAY: Friday
      \arg          RTC_SATURDAY: Saturday
      \arg          RTC_SUNDAY: Sunday
                  rtc_hour: 0 - 24 or 1 - 12
                  rtc_minute: 0 - 59
                  rtc_second: 0 - 59
                  rtc_am_pm:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_AM: AM format
      \arg          RTC_PM: PM format
                  rtc_daylight_saving:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_DAYLIGHT_SAVING_NONE: no daylight saving
      \arg          RTC_DAYLIGHT_SAVING_ADD_1H: add 1 hour(summer time change)
      \arg          RTC_DAYLIGHT_SAVING_SUB_1H: subtract 1 hour(winter time change)
                  rtc_clock_format:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_24H_FORMAT: 24-hour format
      \arg          RTC_12H_FORMAT: 12-hour format
                  rtc_psc_factor_s: 0x0 - 0x7FFF
                  rtc_psc_factor_a: 0x0 - 0x7F
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_init(hal_rtc_dev_struct *rtc_dev, hal_rtc_init_struct *rtc_init)
{
    ErrStatus error_status = ERROR;
    uint32_t reg_time = 0x00U, reg_date = 0x00U;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == rtc_dev) || (NULL == rtc_init)) {
        HAL_DEBUGE("pointer [*rtc_dev] or pointer [*rtc_init] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }

    /* check parameter rtc_init->rtc_year */
    if(rtc_init->rtc_year > 99) {
        HAL_DEBUGE("parameter [rtc_init->rtc_year] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check parameter rtc_init->rtc_date */
    if((rtc_init->rtc_date < 1U) || (rtc_init->rtc_date > 31U)) {
        HAL_DEBUGE("parameter [rtc_init->rtc_date] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check parameter rtc_init->rtc_clock_format */
    if((RTC_24H_FORMAT != rtc_init->rtc_clock_format) && (RTC_12H_FORMAT != rtc_init->rtc_clock_format)) {
        HAL_DEBUGE("parameter [rtc_init->rtc_clock_format] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check parameter rtc_initpara_struct->rtc_hour, and rtc_initpara_struct->rtc_am_pm */
    if(RTC_12H_FORMAT == rtc_init->rtc_clock_format) {

        if((rtc_init->rtc_hour < 1U) || (rtc_init->rtc_hour > 12U)) {
            HAL_DEBUGE("parameter [rtc_init->rtc_hour] value is invalid");
            return HAL_ERR_VAL;
        }
        if((RTC_AM != rtc_init->rtc_am_pm) && (RTC_PM != rtc_init->rtc_am_pm)) {
            HAL_DEBUGE("parameter [rtc_init->rtc_am_pm] value is invalid");
            return HAL_ERR_VAL;
        }
    } else {
        if(rtc_init->rtc_hour > 23U) {
            HAL_DEBUGE("parameter [rtc_init->rtc_hour] value is invalid");
            return HAL_ERR_VAL;
        }
        rtc_init->rtc_am_pm = RTC_AM;
    }

    /* check parameter rtc_initpara_struct->rtc_minute */
    if(rtc_init->rtc_minute > 59) {
        HAL_DEBUGE("parameter [rtc_init->rtc_minute] value is invalid");
        return HAL_ERR_VAL;
    }

