PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rtc.c
    /* check parameter rtc_initpara_struct->rtc_second */
    if(rtc_init->rtc_second > 59) {
        HAL_DEBUGE("parameter [rtc_init->rtc_second] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check parameter rtc_initpara_struct->rtc_factor_syn */
    if(rtc_init->rtc_psc_factor_s > 0x7FFF) {
        HAL_DEBUGE("parameter [rtc_init->rtc_psc_factor_s] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check parameter rtc_initpara_struct->rtc_factor_asyn */
    if(rtc_init->rtc_psc_factor_a > 0x7F) {
        HAL_DEBUGE("parameter [rtc_init->rtc_psc_factor_a] value is invalid");
        return HAL_ERR_VAL;
    }

#endif /* 1 = HAL_PARAMETER_CHECK */
    rtc_dev->state = HAL_RTC_STATE_BUSY;

    /* calendar config */
    /* 1st: disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;
    /* 2nd: enter init mode */
    error_status = hals_rtc_init_mode_enter();
    if(ERROR != error_status) {
        RTC_PSC = (uint32_t)(PSC_FACTOR_A(rtc_init->rtc_psc_factor_a) | \
                             PSC_FACTOR_S(rtc_init->rtc_psc_factor_s));
        RTC_CTL &= (uint32_t)(~RTC_CTL_CS);
        RTC_CTL |=  rtc_init->rtc_clock_format;
        reg_date = (DATE_YR(hals_rtc_normal_2_bcd(rtc_init->rtc_year)) | \
                    DATE_DOW(hals_rtc_normal_2_bcd(rtc_init->rtc_day_of_week)) | \
                    DATE_MON(hals_rtc_normal_2_bcd(rtc_init->rtc_month)) | \
                    DATE_DAY(hals_rtc_normal_2_bcd(rtc_init->rtc_date)));

        reg_time = (rtc_init->rtc_am_pm | \
                    TIME_HR(hals_rtc_normal_2_bcd(rtc_init->rtc_hour)) | \
                    TIME_MN(hals_rtc_normal_2_bcd(rtc_init->rtc_minute)) | \
                    TIME_SC(hals_rtc_normal_2_bcd(rtc_init->rtc_second)));
        RTC_TIME = (uint32_t)reg_time;
        RTC_DATE = (uint32_t)reg_date;
        RTC_TIME &= (uint32_t)(~RTC_PM);
        RTC_TIME |=  rtc_init->rtc_am_pm;
        RTC_CTL &= (uint32_t)(~(RTC_DAYLIGHT_SAVING_ADD_1H | RTC_DAYLIGHT_SAVING_SUB_1H));
        RTC_CTL |= rtc_init->rtc_daylight_saving;

        /* 3rd: exit init mode */
        hals_rtc_init_mode_exit();
        /* 4th: wait the RSYNF flag to set */
        error_status = hals_rtc_register_sync_wait();
    }
    /* 5th: enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    if(ERROR == error_status) {
        return HAL_ERR_BUSY;
    }

    /* change RTC error state */
    rtc_dev->error_state = HAL_RTC_ERROR_NONE;
    /* change RTC state */
    rtc_dev->state = HAL_RTC_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      configure RTC alarm output
    \param[in]  rtc_dev: RTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  hal_rtc_alarm_output_config_struct: the pointer of RTC alarm output configure structure
                  rtc_alarm_output_polarity:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_HIGH: enable alarm flag output with high level
      \arg          RTC_ALARM_LOW: enable alarm flag output with low level
                  rtc_alarm_output_type:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_OUTPUT_OD: RTC alarm output open-drain mode
      \arg          RTC_ALARM_OUTPUT_PP: RTC alarm output push-pull mode
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_alarm_output_config(hal_rtc_dev_struct *rtc_dev,
                                    hal_rtc_alarm_output_config_struct *rtc_alarm_output_config)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == rtc_dev) || (NULL == rtc_alarm_output_config)) {
        HAL_DEBUGE("pointer [*rtc_dev] or pointer [*rtc_alarm_output_config] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    rtc_dev->state = HAL_RTC_STATE_BUSY;

    /* alram output config */
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;
    RTC_CTL &= (uint32_t)~(RTC_CTL_OS | RTC_CTL_OPOL);

    RTC_CTL |= (uint32_t)(rtc_alarm_output_config->rtc_alarm_output_polarity);

    /* alarm output */
    RTC_TAMP &= (uint32_t)~(RTC_TAMP_PC13VAL);
    RTC_TAMP |= (uint32_t)(rtc_alarm_output_config->rtc_alarm_output_type);

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    /* change RTC error state */
    rtc_dev->error_state = HAL_RTC_ERROR_NONE;
    /* change RTC state */
    rtc_dev->state = HAL_RTC_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      configure RTC alarm
    \param[in]  rtc_dev: RTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  hal_rtc_alarm_config_struct: the pointer of RTC alarm configure structure
                  rtc_alarm_am_pm:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_AM: AM format
      \arg          RTC_ALARM_PM: PM format
                  rtc_alarm_weekday_mask:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_WEEKDAY_MASK_DISABLE: RTC alarm weekday no mask
      \arg          RTC_ALARM_WEEKDAY_MASK_ENABLE: RTC alarm weekday mask
                  rtc_alarm_hour_mask:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_HOUR_MASK_DISABLE: RTC alarm hour no mask
      \arg          RTC_ALARM_HOUR_MASK_ENABLE: RTC alarm hour mask
                  rtc_alarm_minute_mask:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_MINUTE_MASK_DISABLE: RTC alarm minute no mask
      \arg          RTC_ALARM_MINUTE_MASK_ENABLE: RTC alarm minute mask
                  rtc_alarm_second_mask:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_SECOND_MASK_DISABLE: RTC alarm second no mask
      \arg          RTC_ALARM_SECOND_MASK_ENABLE: RTC alarm second mask
                  rtc_alarm_subsecond_mask:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_MASKSSC_0_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_1_14: RTC alarm second mask
      \arg          RTC_MASKSSC_2_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_3_14: RTC alarm second mask
      \arg          RTC_MASKSSC_4_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_5_14: RTC alarm second mask
      \arg          RTC_MASKSSC_6_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_7_14: RTC alarm second mask
      \arg          RTC_MASKSSC_8_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_9_14: RTC alarm second mask
      \arg          RTC_MASKSSC_10_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_11_14: RTC alarm second mask
      \arg          RTC_MASKSSC_12_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_13_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_14: RTC alarm second mask
      \arg          RTC_MASKSSC_NONE: RTC alarm second mask
                  rtc_weekday_or_date:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_SELECT_WEEKDAY: RTC alarm select weekday
      \arg          RTC_ALARM_SELECT_DATE: RTC alarm select date
                  rtc_alarm_day: 1 - 31 or below
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_MONDAY: RTC alarm Monday
      \arg          RTC_ALARM_TUESDAY: RTC alarm Tuesday
      \arg          RTC_ALARM_WEDSDAY: RTC alarm Wednesday
      \arg          RTC_ALARM_THURSDAY: RTC alarm Thursday
      \arg          RTC_ALARM_FRIDAY: RTC alarm Friday
      \arg          RTC_ALARM_SATURDAY: RTC alarm Saturday
      \arg          RTC_ALARM_SUNDAY: RTC alarm Sunday
                  rtc_hour: 0 - 24 or 1 - 12
                  rtc_minute: 0 - 59
                  rtc_second: 0 - 59
                  rtc_alarm_subsecond: 0x00~0x7FFF
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_alarm_config(hal_rtc_dev_struct *rtc_dev, hal_rtc_alarm_config_struct *rtc_alarm_config)
{
    uint32_t reg_alrm0td = 0x00U;
    uint32_t reg_alrm0ss = 0x00U;
#if (1 == HAL_PARAMETER_CHECK)
    uint32_t rtc_display_format = 0U;
    /* check the parameters */
    if((NULL == rtc_dev) || (NULL == rtc_alarm_config)) {
        HAL_DEBUGE("pointer [*rtc_dev] or pointer [*rtc_alarm_config] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }

    /* check parameter rtc_alarm_time->rtc_alarm_mask */
    if(0x80808080U != ((rtc_alarm_config->rtc_alarm_hour_mask | rtc_alarm_config->rtc_alarm_minute_mask |
                        rtc_alarm_config->rtc_alarm_second_mask) | 0x80808080U)) {
        HAL_DEBUGE("parameter [rtc_alarm_time->rtc_alarm_mask] value is invalid");
        return HAL_ERR_VAL;
    }

    rtc_display_format = RTC_CTL & RTC_CTL_CS;
    /* check parameter rtc_alarm_config->rtc_alarm_hour, and rtc_alarm_config->rtc_alarm_am_pm */
    if(0U != rtc_display_format) {

