PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rtc.c
        if((rtc_alarm_config->rtc_alarm_hour < 1U) || (rtc_alarm_config->rtc_alarm_hour > 12U)) {
            HAL_DEBUGE("parameter [rtc_alarm_config->rtc_alarm_hour] value is invalid");
            return HAL_ERR_VAL;
        }
        if((RTC_ALARM_AM != rtc_alarm_config->rtc_alarm_am_pm) && (RTC_ALARM_PM != rtc_alarm_config->rtc_alarm_am_pm)) {
            HAL_DEBUGE("parameter [rtc_alarm_config->rtc_alarm_am_pm] value is invalid");
            return HAL_ERR_VAL;
        }
    } else {
        if(rtc_alarm_config->rtc_alarm_hour > 23U) {
            HAL_DEBUGE("parameter [rtc_alarm_config->rtc_alarm_hour] value is invalid");
            return HAL_ERR_VAL;
        }
        rtc_alarm_config->rtc_alarm_am_pm = RTC_ALARM_AM;
    }

    /* check parameter rtc_alarm_time->rtc_alarm_minute */
    if(rtc_alarm_config->rtc_alarm_minute > 59) {
        HAL_DEBUGE("parameter [rtc_alarm_config->rtc_alarm_minute] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check parameter rtc_alarm_time->rtc_alarm_second */
    if(rtc_alarm_config->rtc_alarm_second > 59) {
        HAL_DEBUGE("parameter [rtc_alarm_config->rtc_alarm_second] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check parameter rtc_alarm_time->rtc_weekday_or_date, and rtc_alarm_time->rtc_alarm_day */
    if(RTC_ALARM_SELECT_DATE == rtc_alarm_config->rtc_weekday_or_date) {
        if((rtc_alarm_config->rtc_alarm_day < 1U) || (rtc_alarm_config->rtc_alarm_day > 31U)) {
            HAL_DEBUGE("parameter [rtc_alarm_config->rtc_weekday_or_date] value is invalid");
            return HAL_ERR_VAL;
        }
    } else if(RTC_ALARM_SELECT_WEEKDAY == rtc_alarm_config->rtc_weekday_or_date) {
        if((rtc_alarm_config->rtc_alarm_day < 1U) || (rtc_alarm_config->rtc_alarm_day > 7U)) {
            HAL_DEBUGE("parameter [rtc_alarm_config->rtc_weekday_or_date] value is invalid");
            return HAL_ERR_VAL;
        }
    } else {
        HAL_DEBUGE("parameter [rtc_alarm_config->rtc_weekday_or_date] value is invalid");
        return HAL_ERR_VAL;
    }

    /* check parameter rtc_alarm_time->rtc_alarm_subsecond_mask */
    if(RTC_ALRM0SS_MASKSSC != (rtc_alarm_config->rtc_alarm_subsecond_mask | RTC_ALRM0SS_MASKSSC)) {
        HAL_DEBUGE("parameter [rtc_alarm_config->rtc_alarm_subsecond_mask] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    rtc_dev->state = HAL_RTC_STATE_BUSY;

    /* alarm config */
    reg_alrm0td = (rtc_alarm_config->rtc_alarm_am_pm | \
                   rtc_alarm_config->rtc_alarm_weekday_mask | \
                   rtc_alarm_config->rtc_alarm_hour_mask | \
                   rtc_alarm_config->rtc_alarm_minute_mask | \
                   rtc_alarm_config->rtc_alarm_second_mask | \
                   rtc_alarm_config->rtc_weekday_or_date | \
                   ALRM0TD_DAY(hals_rtc_normal_2_bcd(rtc_alarm_config->rtc_alarm_day)) | \
                   ALRM0TD_HR(hals_rtc_normal_2_bcd(rtc_alarm_config->rtc_alarm_hour)) | \
                   ALRM0TD_MN(hals_rtc_normal_2_bcd(rtc_alarm_config->rtc_alarm_minute)) | \
                   ALRM0TD_SC(hals_rtc_normal_2_bcd(rtc_alarm_config->rtc_alarm_second)));
    reg_alrm0ss = rtc_alarm_config->rtc_alarm_subsecond_mask | \
                  SS_SSC(rtc_alarm_config->rtc_alarm_subsecond);

    /* disable RTC alarm */
    if(ERROR == hals_rtc_alarm_disable()) {
        HAL_DEBUGE("disable RTC alarm error");
        return HAL_ERR_TIMEOUT;
    }

    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    RTC_ALRM0TD = (uint32_t)reg_alrm0td;
    RTC_ALRM0SS = reg_alrm0ss;

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    /* change RTC error state */
    rtc_dev->error_state = HAL_RTC_ERROR_NONE;
    /* change RTC state */
    rtc_dev->state = HAL_RTC_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      configure RTC tamper
    \param[in]  rtc_dev: RTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  hal_rtc_alarm_config_struct: the pointer of RTC alarm configure structure
                  rtc_tamper_filter:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_FLT_EDGE: detecting tamper event using edge mode. precharge duration is disabled automatically
      \arg          RTC_FLT_2S: detecting tamper event using level mode.2 consecutive valid level samples will make a effective tamper event
      \arg          RTC_FLT_4S: detecting tamper event using level mode.4 consecutive valid level samples will make an effective tamper event
      \arg          RTC_FLT_8S: detecting tamper event using level mode.8 consecutive valid level samples will make a effective tamper event
                  rtc_tamper_sample_frequency:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_FREQ_DIV32768: sample once every 32768 RTCCLK(1Hz if RTCCLK=32.768KHz)
      \arg          RTC_FREQ_DIV16384: sample once every 16384 RTCCLK(2Hz if RTCCLK=32.768KHz)
      \arg          RTC_FREQ_DIV8192: sample once every 8192 RTCCLK(4Hz if RTCCLK=32.768KHz)
      \arg          RTC_FREQ_DIV4096: sample once every 4096 RTCCLK(8Hz if RTCCLK=32.768KHz)
      \arg          RTC_FREQ_DIV2048: sample once every 2048 RTCCLK(16Hz if RTCCLK=32.768KHz)
      \arg          RTC_FREQ_DIV1024: sample once every 1024 RTCCLK(32Hz if RTCCLK=32.768KHz)
      \arg          RTC_FREQ_DIV512: sample once every 512 RTCCLK(64Hz if RTCCLK=32.768KHz)
      \arg          RTC_FREQ_DIV256: sample once every 256 RTCCLK(128Hz if RTCCLK=32.768KHz)
                  rtc_tamper_precharge_enable:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_PRCH_DISALE:  RTC tamper precharge feature disable during a voltage level detection
      \arg          RTC_PRCH_ENALE: RTC tamper precharge feature enable during a voltage level detection
                  rtc_tamper_precharge_time:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_PRCH_1C: 1 RTC clock prechagre time before each sampling
      \arg          RTC_PRCH_2C: 2 RTC clock prechagre time before each sampling
      \arg          RTC_PRCH_4C: 4 RTC clock prechagre time before each sampling
      \arg          RTC_PRCH_8C: 8 RTC clock prechagre time before each sampling
                  rtc_tamper_with_timestamp:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_TAMPER_TIMESTAMP_DISALE: RTC tamper time-stamp feature disable
      \arg          RTC_TAMPER_TIMESTAMP_ENALE: RTC tamper time-stamp feature enable
                  rtc_tamper0_trigger:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_TAMPER_TRIGGER_EDGE_RISING: tamper detection is in rising edge mode
      \arg          RTC_TAMPER_TRIGGER_EDGE_FALLING: tamper detection is in falling edge mode
      \arg          RTC_TAMPER_TRIGGER_LEVEL_LOW: tamper detection is in low level mode
      \arg          RTC_TAMPER_TRIGGER_LEVEL_HIGH: tamper detection is in high level mode
                  rtc_tamper1_trigger:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_TAMPER_TRIGGER_EDGE_RISING: tamper detection is in rising edge mode
      \arg          RTC_TAMPER_TRIGGER_EDGE_FALLING: tamper detection is in falling edge mode
      \arg          RTC_TAMPER_TRIGGER_LEVEL_LOW: tamper detection is in low level mode
      \arg          RTC_TAMPER_TRIGGER_LEVEL_HIGH: tamper detection is in high level mode
                  rtc_tamper0_source:
      \arg          ENABLE: enable TAMPER0
      \arg          DISABLE: disable TAMPER0
                  rtc_tamper1_source:
      \arg          ENABLE: enable TAMPER1
      \arg          DISABLE: disable TAMPER1
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_tamp_config(hal_rtc_dev_struct *rtc_dev, hal_rtc_tamper_config_struct *rtc_tamper_config)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == rtc_dev) || (NULL == rtc_tamper_config)) {
        HAL_DEBUGE("pointer [*rtc_dev] or pointer [*rtc_tamper_config] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }

