PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rtc.c
#endif /* 1 = HAL_PARAMETER_CHECK */
    rtc_dev->state = HAL_RTC_STATE_BUSY;

    /* tamper config */
    /* tamper filter must be used when the tamper source is voltage level detection */
    RTC_TAMP &= (uint32_t)~(RTC_TAMP_DISPU | RTC_TAMP_PRCH | RTC_TAMP_FREQ | RTC_TAMP_FLT | RTC_TAMP_TPTS | RTC_TAMP_TP0EG |
                            RTC_TAMP_TP1EG | RTC_TAMPER0 | RTC_TAMPER1);
    RTC_TAMP |= (rtc_tamper_config->rtc_tamper_filter | \
                 rtc_tamper_config->rtc_tamper_sample_frequency | \
                 rtc_tamper_config->rtc_tamper_precharge_enable | \
                 rtc_tamper_config->rtc_tamper_precharge_time | \
                 rtc_tamper_config->rtc_tamper_with_timestamp | \
                 (rtc_tamper_config->rtc_tamper0_trigger << 1) | \
                 (rtc_tamper_config->rtc_tamper1_trigger << 4)
                );

    /* change RTC error state */
    rtc_dev->error_state = HAL_RTC_ERROR_NONE;
    /* change RTC state */
    rtc_dev->state = HAL_RTC_STATE_READY;

    if(rtc_tamper_config->rtc_tamper0_source == ENABLE) {
        /* enable tamper0 */
        RTC_TAMP |= RTC_TAMPER0;
    }

    if(rtc_tamper_config->rtc_tamper1_source == ENABLE) {
        /* enable tamper1 */
        RTC_TAMP |= RTC_TAMPER1;
    }
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      configure RTC time stamp
    \param[in]  rtc_dev: RTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  rtc_timestamp_config: rtc timestamp configuration
                  only one parameter can be selected which is shown as below:
      \arg          RTC_TIMESTAMP_RISING_EDGE: rising edge is valid event edge for time-stamp event
      \arg          RTC_TIMESTAMP_FALLING_EDGE: falling edge is valid event edge for time-stamp event
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_timestamp_config(hal_rtc_dev_struct *rtc_dev, uint32_t rtc_timestamp_config)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == rtc_dev) {
        HAL_DEBUGE("pointer [*rtc_dev] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    rtc_dev->state = HAL_RTC_STATE_BUSY;

    /* tamper config */
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;
    /* clear the bits to be configured in RTC_CTL */
    RTC_CTL &= (uint32_t)(~(RTC_CTL_TSEG));
    /* new configuration */
    RTC_CTL |= (uint32_t)(rtc_timestamp_config | RTC_CTL_TSEN);

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    /* change RTC error state */
    rtc_dev->error_state = HAL_RTC_ERROR_NONE;
    /* change RTC state */
    rtc_dev->state = HAL_RTC_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      configure RTC calibration
    \param[in]  rtc_dev: RTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  rtc_calib_config: rtc calibration configuration
                  only one parameter can be selected which is shown as below:
      \arg          RTC_CALIBRATION_NONE: calibration output none
      \arg          RTC_CALIBRATION_OUTPUT_512HZ: calibration output of 512Hz is enable
      \arg          RTC_CALIBRATION_OUTPUT_1HZ: calibration output of 1Hz is enable
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_calib_config(hal_rtc_dev_struct *rtc_dev, uint8_t rtc_calib_config)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == rtc_dev) {
        HAL_DEBUGE("pointer [*rtc_dev] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    rtc_dev->state = HAL_RTC_STATE_BUSY;

    /* tamper config */
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    switch(rtc_calib_config) {
    case RTC_CALIBRATION_NONE:
        /* clear the bits to be configured in RTC_CTL */
        RTC_CTL &= (uint32_t)(~(RTC_CTL_COEN));
        break;
    case RTC_CALIBRATION_OUTPUT_512HZ:
        /* clear the bits to be configured in RTC_CTL */
        RTC_CTL &= (uint32_t)(~(RTC_CTL_COS));
        RTC_CTL |= (uint32_t)((RTC_CTL_COEN));
        break;
    case RTC_CALIBRATION_OUTPUT_1HZ:
        /* clear the bits to be configured in RTC_CTL */
        RTC_CTL |= (uint32_t)(RTC_CTL_COEN | RTC_CTL_COS);
        break;
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
    /* change RTC error state */
    rtc_dev->error_state = HAL_RTC_ERROR_NONE;
    /* change RTC state */
    rtc_dev->state = HAL_RTC_STATE_READY;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      configure RTC reference clock detection function
    \param[in]  rtc_dev: RTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  refclock_detection: rtc reference clock detection
                  only one parameter can be selected which is shown as below:
      \arg          DISABLE: disable RTC reference clock detection function
      \arg          ENABLE: enable RTC reference clock detection function
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_refclock_detection_config(hal_rtc_dev_struct *rtc_dev, ControlStatus refclock_detection)
{
    ErrStatus error_status = ERROR;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == rtc_dev) {
        HAL_DEBUGE("pointer [*rtc_dev] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    rtc_dev->state = HAL_RTC_STATE_BUSY;

    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* enter init mode */
    error_status = hals_rtc_init_mode_enter();

    if(ERROR != error_status) {
        if(ENABLE == refclock_detection) {
            RTC_CTL |= (uint32_t)RTC_CTL_REFEN;
        } else {
            RTC_CTL &= (uint32_t)~RTC_CTL_REFEN;
        }
        /* exit init mode */
        hals_rtc_init_mode_exit();
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;

    if(ERROR != error_status) {
        /* change RTC error state */
        rtc_dev->error_state = HAL_RTC_ERROR_NONE;
        /* change RTC state */
        rtc_dev->state = HAL_RTC_STATE_READY;
        /* return function state */
        return HAL_ERR_NONE;
    } else {
        /* change RTC error state */
        rtc_dev->error_state = HAL_RTC_ERROR_SYSTEM;
        /* change RTC state */
        rtc_dev->state = HAL_RTC_STATE_ERROR;
        /* return function state */
        return HAL_ERR_HARDWARE;
    }
}

/*!
    \brief      initialize the RTC structure with the default values
    \param[in]  hal_struct_type: the argument could be selected from enumeration <hal_rtc_struct_type_enum>
    \param[out]  p_struct: pointer to RTC structure that contains the configuration information
    \retval     none
*/
void hal_rtc_struct_init(hal_rtc_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct) {
        HAL_DEBUGE("pointer [*p_struct] value is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

