PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rtc.c
    switch(hal_struct_type) {
    case HAL_RTC_INIT_STRUCT:
        /* RTC init struct */
        ((hal_rtc_init_struct *)p_struct)->rtc_year                             = 0x00;
        ((hal_rtc_init_struct *)p_struct)->rtc_month                            = RTC_JAN;
        ((hal_rtc_init_struct *)p_struct)->rtc_date                             = 0x1;
        ((hal_rtc_init_struct *)p_struct)->rtc_day_of_week                      = RTC_MONDAY;
        ((hal_rtc_init_struct *)p_struct)->rtc_hour                             = 0x0;
        ((hal_rtc_init_struct *)p_struct)->rtc_minute                           = 0x0;
        ((hal_rtc_init_struct *)p_struct)->rtc_second                           = 0x0;
        ((hal_rtc_init_struct *)p_struct)->rtc_am_pm                            = RTC_AM;
        ((hal_rtc_init_struct *)p_struct)->rtc_daylight_saving                  = RTC_DAYLIGHT_SAVING_NONE;
        ((hal_rtc_init_struct *)p_struct)->rtc_clock_format                     = RTC_24H_FORMAT;
        ((hal_rtc_init_struct *)p_struct)->rtc_psc_factor_s                     = 0x18F;
        ((hal_rtc_init_struct *)p_struct)->rtc_psc_factor_a                     = 0x63;
        break;
    case HAL_RTC_ALARM_OUTPUT_CONFIG_STRUCT:
        /* RTC alarm out config struct */
        ((hal_rtc_alarm_output_config_struct *)p_struct)->rtc_alarm_output_polarity        = RTC_ALARM_HIGH;
        ((hal_rtc_alarm_output_config_struct *)p_struct)->rtc_alarm_output_polarity        = RTC_ALARM_OUTPUT_OD;
        break;
    case HAL_RTC_ALARM_CONFIG_STRUCT:
        /* RTC alarm config struct */
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_alarm_am_pm                         = RTC_ALARM_AM;
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_alarm_weekday_mask                  = RTC_ALARM_WEEKDAY_MASK_DISABLE;
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_alarm_hour_mask                     = RTC_ALARM_HOUR_MASK_DISABLE;
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_alarm_minute_mask                   = RTC_ALARM_MINUTE_MASK_DISABLE;
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_alarm_second_mask                   = RTC_ALARM_SECOND_MASK_DISABLE;
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_alarm_subsecond_mask                = RTC_MASKSSC_0_14;
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_weekday_or_date                     = RTC_ALARM_SELECT_WEEKDAY;
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_alarm_day                           = RTC_ALARM_MONDAY;
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_alarm_hour                          = 0x0;
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_alarm_minute                        = 0x0;
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_alarm_second                        = 0x0;
        ((hal_rtc_alarm_config_struct *)p_struct)->rtc_alarm_subsecond                     = 0x0;
        break;
    case HAL_RTC_TAMPER_CONFIG_STRUCT:
        /* RTC alarm config struct */
        ((hal_rtc_tamper_config_struct *)p_struct)->rtc_tamper_filter                      = RTC_FLT_EDGE;
        ((hal_rtc_tamper_config_struct *)p_struct)->rtc_tamper_sample_frequency            = RTC_FREQ_DIV32768;
        ((hal_rtc_tamper_config_struct *)p_struct)->rtc_tamper_precharge_time              = RTC_PRCH_1C;
        ((hal_rtc_tamper_config_struct *)p_struct)->rtc_tamper_precharge_enable            = RTC_PRCH_DISALE;
        ((hal_rtc_tamper_config_struct *)p_struct)->rtc_tamper_with_timestamp              = RTC_TAMPER_TIMESTAMP_DISALE;
        ((hal_rtc_tamper_config_struct *)p_struct)->rtc_tamper0_trigger                    = RTC_TAMPER_TRIGGER_EDGE_RISING;
        ((hal_rtc_tamper_config_struct *)p_struct)->rtc_tamper1_trigger                    = RTC_TAMPER_TRIGGER_EDGE_RISING;
        ((hal_rtc_tamper_config_struct *)p_struct)->rtc_tamper0_source                     = DISABLE;
        ((hal_rtc_tamper_config_struct *)p_struct)->rtc_tamper1_source                     = ENABLE;
        break;
    case HAL_RTC_TIMESTAMP_STRUCT:
        /* RTC timestamp config struct */
        ((hal_rtc_timestamp_struct *)p_struct)->rtc_timestamp_month = RTC_JAN;
        ((hal_rtc_timestamp_struct *)p_struct)->rtc_timestamp_date = 0x1;
        ((hal_rtc_timestamp_struct *)p_struct)->rtc_timestamp_weekday = RTC_MONDAY;
        ((hal_rtc_timestamp_struct *)p_struct)->rtc_timestamp_hour = 0x0;
        ((hal_rtc_timestamp_struct *)p_struct)->rtc_timestamp_minute = 0x0;
        ((hal_rtc_timestamp_struct *)p_struct)->rtc_timestamp_second = 0x0;
        ((hal_rtc_timestamp_struct *)p_struct)->rtc_timestamp_subsecond = 0x0;
        ((hal_rtc_timestamp_struct *)p_struct)->rtc_am_pm = RTC_AM;
        break;
    case HAL_RTC_IRQ_STRUCT:
        /* initialize RTC initialization structure with the default values */
        ((hal_rtc_irq_struct *)p_struct)->rtc_timestamp_handle                             = NULL;
        ((hal_rtc_irq_struct *)p_struct)->rtc_alarm_handle                                 = NULL;
        ((hal_rtc_irq_struct *)p_struct)->rtc_tamper0_handle                                 = NULL;
        ((hal_rtc_irq_struct *)p_struct)->rtc_tamper1_handle                                 = NULL;
        break;
    case HAL_RTC_DEV_STRUCT:
        /* initialize RTC initialization structure with the default values */
        ((hal_rtc_dev_struct *)p_struct)->rtc_irq.rtc_timestamp_handle                     = NULL;
        ((hal_rtc_dev_struct *)p_struct)->rtc_irq.rtc_alarm_handle                         = NULL;
        ((hal_rtc_dev_struct *)p_struct)->rtc_irq.rtc_tamper0_handle                         = NULL;
        ((hal_rtc_dev_struct *)p_struct)->rtc_irq.rtc_tamper1_handle                         = NULL;
        ((hal_rtc_dev_struct *)p_struct)->error_state                                      = HAL_RTC_ERROR_NONE;
        ((hal_rtc_dev_struct *)p_struct)->state                                            = HAL_RTC_STATE_NONE;
        ((hal_rtc_dev_struct *)p_struct)->mutex                                            = HAL_MUTEX_UNLOCKED;
        ((hal_rtc_dev_struct *)p_struct)->priv                                             = NULL;
        break;
    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize RTC device structure and init structure
    \param[out]  rtc_dev: RTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_deinit(hal_rtc_dev_struct *rtc_dev)
{
    ErrStatus error_status = ERROR;
    int32_t ret_status = HAL_ERR_TIMEOUT;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == rtc_dev) {
        HAL_DEBUGE("pointer [rtc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    rtc_dev->state = HAL_RTC_STATE_BUSY;
    /* deinit RTC */

    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;
    /* enter init mode */
    error_status = hals_rtc_init_mode_enter();
    if(ERROR != error_status) {
        /* before reset RTC_TIME and RTC_DATE, BPSHAD bit in RTC_CTL should be reset as the condition.
           in order to read calendar from shadow register, not the real registers being reset */
        RTC_TIME = RTC_REGISTER_RESET;
        RTC_DATE = RTC_DATE_RESET;

