PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rtc.c
        RTC_PSC = RTC_PSC_RESET;

        /* reset RTC_STAT register, also exit init mode.
           at the same time, RTC_STAT_SOPF bit is reset, as the condition to reset RTC_SHIFTCTL register later */
        RTC_STAT = RTC_STAT_RESET;

        /* to write RTC_ALRM0SS register, ALRM0EN bit in RTC_CTL register should be reset as the condition */
        RTC_ALRM0TD = RTC_REGISTER_RESET;
        RTC_ALRM0SS = RTC_REGISTER_RESET;

        /* reset RTC_SHIFTCTL and RTC_HRFC register, this can be done without the init mode */
        RTC_SHIFTCTL = RTC_REGISTER_RESET;
        RTC_HRFC = RTC_REGISTER_RESET;

        ret_status = hals_rtc_register_sync_wait();
        if(HAL_ERR_TIMEOUT == ret_status) {
            HAL_DEBUGE("rtc register synchronized with APB clock timout");
            return HAL_ERR_TIMEOUT;
        }
    } else {
        /* enable the write protection */
        RTC_WPK = RTC_LOCK_KEY;

        HAL_DEBUGE("rtc enter init mode timout");
        return HAL_ERR_TIMEOUT;
    }

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;

    /* change RTC error state and state */
    rtc_dev->error_state = HAL_RTC_ERROR_NONE;
    rtc_dev->state = HAL_RTC_STATE_NONE;

    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      enbale RTC interrupt
    \param[in]  rtc_dev: RTC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: RTC interrupt callback function structure
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_interrupt_enable(hal_rtc_dev_struct *rtc_dev, hal_rtc_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == rtc_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [rtc_dev] or pointer [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* lock RTC */
    HAL_LOCK(rtc_dev);
    rtc_dev->state = HAL_RTC_STATE_BUSY;
    rtc_dev->rtc_irq.rtc_timestamp_handle = p_irq->rtc_timestamp_handle;
    rtc_dev->rtc_irq.rtc_alarm_handle = p_irq->rtc_alarm_handle;
    rtc_dev->rtc_irq.rtc_tamper0_handle = p_irq->rtc_tamper0_handle;
    rtc_dev->rtc_irq.rtc_tamper1_handle = p_irq->rtc_tamper1_handle;

    /* clear the specified RTC interrupt flag and enable RTC interrupt */
    if(NULL != rtc_dev->rtc_irq.rtc_timestamp_handle) {
        hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP);
        hals_rtc_interrupt_enable(RTC_INT_TIMESTAMP);
    } else{
        hals_rtc_interrupt_disable(RTC_INT_TIMESTAMP);
    }

    if(NULL != rtc_dev->rtc_irq.rtc_alarm_handle) {
        hals_rtc_flag_clear(RTC_FLAG_ALARM0);
        hals_rtc_interrupt_enable(RTC_INT_ALARM);
    } else{
        hals_rtc_interrupt_disable(RTC_INT_ALARM);
    }

    if(NULL != rtc_dev->rtc_irq.rtc_tamper0_handle) {
        hals_rtc_flag_clear(RTC_FLAG_TAMP0);
        hals_rtc_interrupt_enable(RTC_INT_TAMP);
    } else{
        hals_rtc_interrupt_disable(RTC_INT_TAMP);
    }

    if(NULL != rtc_dev->rtc_irq.rtc_tamper1_handle) {
        hals_rtc_flag_clear(RTC_FLAG_TAMP1);
        hals_rtc_interrupt_enable(RTC_INT_TAMP);
    } else{
        hals_rtc_interrupt_disable(RTC_INT_TAMP);
    }

    /* unlock rtc */
    HAL_UNLOCK(rtc_dev);
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      disable RTC interrupt
    \param[in]  rtc_dev: RTC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_ADDRESS, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_interrupt_disable(hal_rtc_dev_struct *rtc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == rtc_dev) {
        HAL_DEBUGE("pointer [rtc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* lock RTC */
    HAL_LOCK(rtc_dev);
    rtc_dev->state = HAL_RTC_STATE_BUSY;
    rtc_dev->rtc_irq.rtc_timestamp_handle = NULL;
    rtc_dev->rtc_irq.rtc_alarm_handle = NULL;
    rtc_dev->rtc_irq.rtc_tamper0_handle = NULL;
    rtc_dev->rtc_irq.rtc_tamper1_handle = NULL;
    /* clear the RTC interrupt flag */
    hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP | RTC_FLAG_ALARM0 | RTC_FLAG_TAMP0 | RTC_FLAG_TAMP1);
    /*  disable RTC interrupt */
    hals_rtc_interrupt_disable(RTC_INT_TIMESTAMP);
    hals_rtc_interrupt_disable(RTC_INT_ALARM);
    hals_rtc_interrupt_disable(RTC_INT_TAMP);
    /* unlock RTC */
    HAL_UNLOCK(rtc_dev);
    /* return function state */
    return HAL_ERR_NONE;
}

/*!
    \brief      RTC interrupt handler content function,which is merely used in rtc_handler
    \param[in]  rtc_dev: RTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_rtc_irq(hal_rtc_dev_struct *rtc_dev)
{
    uint32_t int_en = 0U;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == rtc_dev) {
        HAL_DEBUGE("pointer [rtc_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* check rtc underflow interrupt state bit */
    int_en = RTC_CTL & RTC_CTL_TSIE;
    if((SET == hals_rtc_flag_get(RTC_FLAG_TIMESTAMP)) && (RESET != int_en)) {
        /* error callback */
        if(NULL != (rtc_dev->rtc_irq.rtc_timestamp_handle)) {
            rtc_dev->rtc_irq.rtc_timestamp_handle(rtc_dev);
        }
        /* clear interrupt flag */
        hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP);
        hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);
        EXTI_PD = (uint32_t)EXTI_RTC_TAMPER_TIMESTAMP_19;

