PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rtc.c
    }

    int_en = RTC_CTL & RTC_CTL_ALRM0IE;
    if((SET == hals_rtc_flag_get(RTC_FLAG_ALARM0)) && (RESET != int_en)) {
        /* clear interrupt flag */
        hals_rtc_flag_clear(RTC_FLAG_ALARM0);
        EXTI_PD = (uint32_t)EXTI_RTC_ALARM_17;

        /* error callback */
        if(NULL != (rtc_dev->rtc_irq.rtc_alarm_handle)) {
            rtc_dev->rtc_irq.rtc_alarm_handle(rtc_dev);
        }
    }
    int_en = RTC_TAMP & RTC_TAMP_TPIE;
    if((SET == (hals_rtc_flag_get(RTC_FLAG_TAMP0))) && (RESET != int_en)) {
        /* clear interrupt flag */
        hals_rtc_flag_clear(RTC_FLAG_TAMP0);

        /* error callback */
        if(NULL != (rtc_dev->rtc_irq.rtc_tamper0_handle)) {
            rtc_dev->rtc_irq.rtc_tamper0_handle(rtc_dev);
        }
        hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP);
        hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);
        EXTI_PD = (uint32_t)EXTI_RTC_TAMPER_TIMESTAMP_19;
    }
    int_en = RTC_TAMP & RTC_TAMP_TPIE;
    if((SET == (hals_rtc_flag_get(RTC_FLAG_TAMP1))) && (RESET != int_en)) {
        /* clear interrupt flag */
        hals_rtc_flag_clear(RTC_FLAG_TAMP1);

        /* error callback */
        if(NULL != (rtc_dev->rtc_irq.rtc_tamper0_handle)) {
            rtc_dev->rtc_irq.rtc_tamper0_handle(rtc_dev);
        }
        hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP);
        hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);
        EXTI_PD = (uint32_t)EXTI_RTC_TAMPER_TIMESTAMP_19;
    }
}

/*!
    \brief      set user-defined interrupt callback function
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  rtc_dev: RTC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to RTC interrupt callback functions structure
                  hal_irq_handle_cb: the function is user-defined,
    \param[out] none
    \retval     none
*/
void hal_rtc_irq_handle_set(hal_rtc_dev_struct *rtc_dev, hal_rtc_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == rtc_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [rtc_dev] or pointer [p_irq] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* RTC interrupt handler set */
    if(NULL != p_irq->rtc_timestamp_handle) {
        rtc_dev->rtc_irq.rtc_timestamp_handle = p_irq->rtc_timestamp_handle;
        hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP);
        hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);
        hals_rtc_interrupt_enable(RTC_INT_TIMESTAMP);
        hal_exti_internal_init(EXTI_LINE_19_RTC_TAMPER_TIMESTAMP, EXTI_INTERRUPT_TRIG_RISING);
    } else {
        rtc_dev->rtc_irq.rtc_timestamp_handle = NULL;
        hals_rtc_interrupt_disable(RTC_INT_TIMESTAMP);
        EXTI_PD = (uint32_t)EXTI_RTC_TAMPER_TIMESTAMP_19;
    }
    if(NULL != p_irq->rtc_alarm_handle) {
        rtc_dev->rtc_irq.rtc_alarm_handle = p_irq->rtc_alarm_handle;
        hals_rtc_flag_clear(RTC_FLAG_ALARM0);
        hals_rtc_interrupt_enable(RTC_INT_ALARM);
        /* enable RTC alarm */
        hal_exti_internal_init(EXTI_LINE_17_RTC_ALARM, EXTI_INTERRUPT_TRIG_RISING);
        hals_rtc_alarm_enable();
    } else {
        rtc_dev->rtc_irq.rtc_alarm_handle = NULL;
        hals_rtc_interrupt_disable(RTC_INT_ALARM);
        /* disable RTC alarm */
        hals_rtc_alarm_disable();
        EXTI_PD = (uint32_t)EXTI_RTC_ALARM_17;
    }
    if(NULL != p_irq->rtc_tamper0_handle) {
        rtc_dev->rtc_irq.rtc_tamper0_handle = p_irq->rtc_tamper0_handle;
    } else {
        rtc_dev->rtc_irq.rtc_tamper0_handle = NULL;
    }
    if(NULL != p_irq->rtc_tamper1_handle) {
        rtc_dev->rtc_irq.rtc_tamper1_handle = p_irq->rtc_tamper1_handle;
    } else {
        rtc_dev->rtc_irq.rtc_tamper1_handle = NULL;
    }
    if((NULL != p_irq->rtc_tamper0_handle) || (NULL != p_irq->rtc_tamper1_handle)) {
        hals_rtc_flag_clear(RTC_FLAG_TAMP0);
        hals_rtc_flag_clear(RTC_FLAG_TAMP1);
        hals_rtc_interrupt_enable(RTC_INT_TAMP);
        hal_exti_internal_init(EXTI_LINE_19_RTC_TAMPER_TIMESTAMP, EXTI_INTERRUPT_TRIG_RISING);
    } else {
        hals_rtc_interrupt_disable(RTC_INT_TAMP);
        EXTI_PD = (uint32_t)EXTI_RTC_TAMPER_TIMESTAMP_19;
    }
}

/*!
    \brief      reset all user-defined interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  rtc_dev: RTC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_rtc_irq_handle_all_reset(hal_rtc_dev_struct *rtc_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == rtc_dev) {
        HAL_DEBUGE("pointer [rtc_dev] address is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    /* RTC interrupt handler set */
    rtc_dev->rtc_irq.rtc_timestamp_handle = NULL;
    rtc_dev->rtc_irq.rtc_alarm_handle = NULL;
    rtc_dev->rtc_irq.rtc_tamper0_handle = NULL;
    rtc_dev->rtc_irq.rtc_tamper1_handle = NULL;
}

/*!
    \brief      get current time and date
    \param[in]  none
    \param[out] rtc_initpara_struct: pointer to a hal_rtc_init_struct structure which contains
                parameters for initialization of the rtc peripheral
                members of the structure and the member values are shown as below:
                  rtc_year: 0~99
                  rtc_month:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_JAN: Janurary
      \arg          RTC_FEB: February
      \arg          RTC_MAR: March
      \arg          RTC_APR: April
      \arg          RTC_MAY: May
      \arg          RTC_JUN: June
      \arg          RTC_JUL: July
      \arg          RTC_AUG: August
      \arg          RTC_SEP: September
      \arg          RTC_OCT: October
      \arg          RTC_NOV: November
      \arg          RTC_DEC: December
                  rtc_date: 0~31
                  rtc_day_of_week:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_MONDAY: Monday
      \arg          RTC_TUESDAY: Tuesday
      \arg          RTC_WEDSDAY: Wednesday
      \arg          RTC_THURSDAY: Thursday
      \arg          RTC_FRIDAY: Friday
      \arg          RTC_SATURDAY: Saturday
      \arg          RTC_SUNDAY: Sunday
                  rtc_hour: 0 - 24 or 1 - 12
                  rtc_minute: 0 - 59
                  rtc_second: 0 - 59
                  rtc_am_pm:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_AM: AM format
      \arg          RTC_PM: PM format
                  rtc_daylight_saving:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_DAYLIGHT_SAVING_NONE: no daylight saving
      \arg          RTC_DAYLIGHT_SAVING_ADD_1H: add 1 hour(summer time change)
      \arg          RTC_DAYLIGHT_SAVING_SUB_1H: subtract 1 hour(winter time change)
                  rtc_clock_format:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_24H_FORMAT: 24-hour format
      \arg          RTC_12H_FORMAT: 12-hour format
                  rtc_psc_factor_s: 0x0 - 0x7FFF
                  rtc_psc_factor_a: 0x0 - 0x7F

