PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rtc.c
    \retval     none
*/
void hal_rtc_current_time_get(hal_rtc_init_struct *rtc_initpara_struct)
{
    uint32_t temp_tr = 0x00U, temp_dr = 0x00U, temp_pscr = 0x00U, temp_ctlr = 0x00U;
    uint16_t temp_ss = 0x00U;

    /* if BPSHAD bit is reset, reading RTC_SS will lock RTC_TIME and RTC_DATE automatically */
    temp_ss = (uint16_t)RTC_SS;
    temp_tr = (uint32_t)RTC_TIME;
    temp_dr = (uint32_t)RTC_DATE;
    temp_pscr = (uint32_t)RTC_PSC;
    temp_ctlr = (uint32_t)RTC_CTL;
    /* read RTC_DATE to unlock the 3 shadow registers */
    (void)(RTC_DATE);

    /* get current time and construct rtc_parameter_struct structure */
    rtc_initpara_struct->rtc_year = hals_rtc_bcd_2_normal((uint8_t)GET_DATE_YR(temp_dr));
    rtc_initpara_struct->rtc_month = hals_rtc_bcd_2_normal(GET_DATE_MON(temp_dr));
    rtc_initpara_struct->rtc_date = hals_rtc_bcd_2_normal((uint8_t)GET_DATE_DAY(temp_dr));
    rtc_initpara_struct->rtc_day_of_week = hals_rtc_bcd_2_normal(GET_DATE_DOW(temp_dr));
    rtc_initpara_struct->rtc_hour = hals_rtc_bcd_2_normal((uint8_t)GET_TIME_HR(temp_tr));
    rtc_initpara_struct->rtc_minute = hals_rtc_bcd_2_normal((uint8_t)GET_TIME_MN(temp_tr));
    rtc_initpara_struct->rtc_second = hals_rtc_bcd_2_normal((uint8_t)GET_TIME_SC(temp_tr));
    rtc_initpara_struct->rtc_subsecond = temp_ss;
    rtc_initpara_struct->rtc_daylight_saving = (uint32_t)(temp_ctlr & (RTC_CTL_A1H | RTC_CTL_S1H));
    rtc_initpara_struct->rtc_psc_factor_a = (uint16_t)GET_PSC_FACTOR_A(temp_pscr);
    rtc_initpara_struct->rtc_psc_factor_s = (uint16_t)GET_PSC_FACTOR_S(temp_pscr);
    rtc_initpara_struct->rtc_am_pm = (uint32_t)(temp_pscr & RTC_TIME_PM);
    rtc_initpara_struct->rtc_clock_format = (uint32_t)(temp_ctlr & RTC_CTL_CS);

}

/*!
    \brief      get RTC alarm
    \param[in]  none
    \param[out] rtc_alarm_time: pointer to a hal_rtc_alarm_struct structure which contains
                parameters for RTC alarm configuration
                members of the structure and the member values are shown as below:
                  rtc_alarm_am_pm:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_AM: AM format
      \arg          RTC_ALARM_PM: PM format
                  rtc_alarm_weekday_mask:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_WEEKDAY_MASK_DISABLE: RTC alarm weekday no mask
      \arg          RTC_ALARM_WEEKDAY_MASK_ENABLE: RTC alarm weekday mask
                  rtc_alarm_hour_mask:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_HOUR_MASK_DISABLE: RTC alarm hour no mask
      \arg          RTC_ALARM_HOUR_MASK_ENABLE: RTC alarm hour mask
                  rtc_alarm_minute_mask:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_MINUTE_MASK_DISABLE: RTC alarm minute no mask
      \arg          RTC_ALARM_MINUTE_MASK_ENABLE: RTC alarm minute mask
                  rtc_alarm_second_mask:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_SECOND_MASK_DISABLE: RTC alarm second no mask
      \arg          RTC_ALARM_SECOND_MASK_ENABLE: RTC alarm second mask
                  rtc_alarm_subsecond_mask:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_MASKSSC_0_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_1_14: RTC alarm second mask
      \arg          RTC_MASKSSC_2_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_3_14: RTC alarm second mask
      \arg          RTC_MASKSSC_4_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_5_14: RTC alarm second mask
      \arg          RTC_MASKSSC_6_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_7_14: RTC alarm second mask
      \arg          RTC_MASKSSC_8_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_9_14: RTC alarm second mask
      \arg          RTC_MASKSSC_10_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_11_14: RTC alarm second mask
      \arg          RTC_MASKSSC_12_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_13_14: RTC alarm second no mask
      \arg          RTC_MASKSSC_14: RTC alarm second mask
      \arg          RTC_MASKSSC_NONE: RTC alarm second mask
                  rtc_weekday_or_date:
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_SELECT_WEEKDAY: RTC alarm select weekday
      \arg          RTC_ALARM_SELECT_DATE: RTC alarm select date
                  rtc_alarm_day: 1 - 31 or below
                  only one parameter can be selected which is shown as below:
      \arg          RTC_ALARM_MONDAY: RTC alarm Monday
      \arg          RTC_ALARM_TUESDAY: RTC alarm Tuesday
      \arg          RTC_ALARM_WEDSDAY: RTC alarm Wednesday
      \arg          RTC_ALARM_THURSDAY: RTC alarm Thursday
      \arg          RTC_ALARM_FRIDAY: RTC alarm Friday
      \arg          RTC_ALARM_SATURDAY: RTC alarm Saturday
      \arg          RTC_ALARM_SUNDAY: RTC alarm Sunday
                  rtc_hour: 0 - 24 or 1 - 12
                  rtc_minute: 0 - 59
                  rtc_second: 0 - 59
                  rtc_alarm_subsecond: 0x00~0x7FFF
    \retval     none
*/
void hal_rtc_alarm_get(hal_rtc_alarm_config_struct *rtc_alarm_time)
{
    uint32_t reg_alrm0td = 0x00U, reg_alrm0ss = 0x00U;

    /* get the value of RTC_ALRM0TD and RTC_ALRM0SS register */
    reg_alrm0td = RTC_ALRM0TD;
    reg_alrm0ss = RTC_ALRM0SS;

    /* get alarm parameters and construct the rtc_alarm_struct structure */
    rtc_alarm_time->rtc_alarm_am_pm = (uint32_t)(reg_alrm0td & RTC_ALRM0TD_PM);
    rtc_alarm_time->rtc_alarm_weekday_mask = (uint32_t)(reg_alrm0td & RTC_ALARM_WEEKDAY_MASK_ENABLE);
    rtc_alarm_time->rtc_alarm_hour_mask = reg_alrm0td & RTC_ALARM_HOUR_MASK_ENABLE;
    rtc_alarm_time->rtc_alarm_minute_mask = reg_alrm0td & RTC_ALARM_MINUTE_MASK_ENABLE;
    rtc_alarm_time->rtc_alarm_second_mask = reg_alrm0td & RTC_ALARM_SECOND_MASK_ENABLE;
    rtc_alarm_time->rtc_alarm_subsecond_mask = reg_alrm0ss & RTC_ALRM0SS_MASKSSC;
    rtc_alarm_time->rtc_weekday_or_date = (uint32_t)(reg_alrm0td & RTC_ALRM0TD_DOWS);
    rtc_alarm_time->rtc_alarm_day = hals_rtc_bcd_2_normal((uint8_t)GET_ALRM0TD_DAY(reg_alrm0td));
    rtc_alarm_time->rtc_alarm_hour = hals_rtc_bcd_2_normal((uint8_t)GET_ALRM0TD_HR(reg_alrm0td));
    rtc_alarm_time->rtc_alarm_minute = hals_rtc_bcd_2_normal((uint8_t)GET_ALRM0TD_MN(reg_alrm0td));
    rtc_alarm_time->rtc_alarm_second = hals_rtc_bcd_2_normal((uint8_t)GET_ALRM0TD_SC(reg_alrm0td));
    rtc_alarm_time->rtc_alarm_subsecond = reg_alrm0ss & RTC_ALRM0SS_SSC;
}

/*!
    \brief      poll for RTC alarm event
    \param[in]  timeout_ms: the time cost for event polling
    \param[out] none
    \retval     error code: HAL_ERR_TIMEOUT, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_alarm_event_poll(uint32_t timeout_ms)
{
    uint32_t flag_status = RESET;
    uint32_t tick_start = 0;

    tick_start = hal_sys_basetick_count_get();
    /* wait until ALRM0F flag to be set after the alarm is enabled */
    do {
        flag_status = RTC_STAT & RTC_STAT_ALRM0F;
    } while((SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) && ((uint32_t)RESET == flag_status));

