PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_rtc.c
    if((uint32_t)RESET == flag_status) {
        return HAL_ERR_TIMEOUT;
    }

    hals_rtc_flag_clear(RTC_FLAG_ALARM0);
    return HAL_ERR_NONE;
}

/*!
    \brief      get RTC timestamp time and date
    \param[in]  none
    \param[out] rtc_timestamp: pointer to a rtc_timestamp_struct structure which contains
                parameters for RTC time-stamp configuration
                members of the structure and the member values are shown as below:
                  rtc_timestamp_month: RTC_JAN, RTC_FEB, RTC_MAR, RTC_APR, RTC_MAY, RTC_JUN,
                                       RTC_JUL, RTC_AUG, RTC_SEP, RTC_OCT, RTC_NOV, RTC_DEC
                  rtc_timestamp_date: 0x1 - 0x31(BCD format)
                  rtc_timestamp_weekday: RTC_MONDAY, RTC_TUESDAY, RTC_WEDSDAY, RTC_THURSDAY, RTC_FRIDAY,
                                     RTC_SATURDAY, RTC_SUNDAY if RTC_ALARM_WEEKDAY_SELECTED is set
                  rtc_timestamp_hour: 0x0 - 0x12(BCD format) or 0x0 - 0x23(BCD format) depending on the rtc_display_format
                  rtc_timestamp_minute: 0x0 - 0x59(BCD format)
                  rtc_timestamp_second: 0x0 - 0x59(BCD format)
                  rtc_am_pm: RTC_AM, RTC_PM
    \retval     none
*/
void hal_rtc_timestamp_get(hal_rtc_timestamp_struct *rtc_timestamp)
{
    uint32_t temp_tts = 0x00U, temp_dts = 0x00U, temp_ssts = 0x00U;

    /* get the value of time_stamp registers */
    temp_tts = (uint32_t)RTC_TTS;
    temp_dts = (uint32_t)RTC_DTS;
    temp_ssts = (uint32_t)RTC_SSTS;

    /* get timestamp time and construct the rtc_timestamp_struct structure */
    rtc_timestamp->rtc_am_pm = (uint32_t)(temp_tts & RTC_TTS_PM);
    rtc_timestamp->rtc_timestamp_month = hals_rtc_bcd_2_normal((uint8_t)GET_DTS_MON(temp_dts));
    rtc_timestamp->rtc_timestamp_date = hals_rtc_bcd_2_normal((uint8_t)GET_DTS_DAY(temp_dts));
    rtc_timestamp->rtc_timestamp_weekday = (uint8_t)GET_DTS_DOW(temp_dts);
    rtc_timestamp->rtc_timestamp_hour = hals_rtc_bcd_2_normal((uint8_t)GET_TTS_HR(temp_tts));
    rtc_timestamp->rtc_timestamp_minute = hals_rtc_bcd_2_normal((uint8_t)GET_TTS_MN(temp_tts));
    rtc_timestamp->rtc_timestamp_second = hals_rtc_bcd_2_normal((uint8_t)GET_TTS_SC(temp_tts));
    rtc_timestamp->rtc_timestamp_subsecond = temp_ssts;

}

/*!
    \brief      poll for RTC timestamp event
    \param[in]  timeout_ms: the time cost for event polling
    \param[out] none
    \retval     error code: HAL_ERR_TIMEOUT, HAL_ERR_HARDWARE, HAL_ERR_NONE,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_timestamp_event_poll(uint32_t timeout_ms)
{
    uint32_t flag_status = RESET;
    uint32_t tick_start = 0;

    /* wait until TSF flag to be set */
    flag_status = RTC_STAT & RTC_STAT_TSF;
    tick_start = hal_sys_basetick_count_get();
    while((SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) && ((uint32_t)RESET == flag_status)) {
        flag_status = RTC_STAT & RTC_STAT_TSF;
        if((uint32_t)RESET != (RTC_STAT & RTC_STAT_TSOVRF)) {
            return HAL_ERR_HARDWARE;
        }
    }

    if((uint32_t)RESET == flag_status) {
        return HAL_ERR_TIMEOUT;
    }

    hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP);
    hals_rtc_flag_clear(RTC_FLAG_TIMESTAMP_OVERFLOW);

    return HAL_ERR_NONE;
}

/*!
    \brief      poll for RTC tamper0 event
    \param[in]  timeout_ms: the time cost for event polling
    \param[out] none
    \retval     error code: HAL_ERR_TIMEOUT, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_tamper0_event_poll(uint32_t timeout_ms)
{
    uint32_t flag_status = RESET;
    uint32_t tick_start = 0;

    tick_start = hal_sys_basetick_count_get();
    /* wait until TP0F flag to be set */
    do {
        flag_status = RTC_STAT & RTC_STAT_TP0F;
    } while((SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) && ((uint32_t)RESET == flag_status));

    if((uint32_t)RESET == flag_status) {
        return HAL_ERR_TIMEOUT;
    }

    hals_rtc_flag_clear(RTC_FLAG_TAMP0);

    return HAL_ERR_NONE;
}

/*!
    \brief      poll for RTC tamper1 event
    \param[in]  timeout_ms: the time cost for event polling
    \param[out] none
    \retval     error code: HAL_ERR_TIMEOUT, HAL_ERR_NONE, details refer to gd32f3x0_hal.h
*/
int32_t hal_rtc_tamper1_event_poll(uint32_t timeout_ms)
{
    uint32_t flag_status = RESET;
    uint32_t tick_start = 0;

    tick_start = hal_sys_basetick_count_get();
    /* wait until TP1F flag to be set */
    do {
        flag_status = RTC_STAT & RTC_STAT_TP1F;
    } while((SET == hal_sys_basetick_timeout_check(tick_start, timeout_ms)) && ((uint32_t)RESET == flag_status));

    if((uint32_t)RESET == flag_status) {
        return HAL_ERR_TIMEOUT;
    }

    hals_rtc_flag_clear(RTC_FLAG_TAMP1);

    return HAL_ERR_NONE;
}

/*!
    \brief      ajust the daylight saving time by adding or substracting one hour from the current time
    \param[in]  operation: hour ajustment operation
                only one parameter can be selected which is shown as below:
      \arg        RTC_DAYLIGHT_SAVING_ADD_1H: add one hour
      \arg        RTC_DAYLIGHT_SAVING_SUB_1H: substract one hour
      \arg        RTC_DAYLIGHT_SAVING_NONE: no add or subtract one hour
    \param[in]  record: daylight saving mark operation
                only one parameter can be selected which is shown as below:
      \arg        RTC_RECORD_DAYLIGHTSAVING_SET: set daylight saving mark
      \arg        RTC_RECORD_DAYLIGHTSAVING_RESET: reset daylight saving mark
    \param[out] none
    \retval     none
*/
void hal_rtc_daylight_saving_time_adjust(uint32_t operation, uint32_t record)
{
    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    RTC_CTL &= (uint32_t)(~(RTC_CTL_A1H | RTC_CTL_S1H | RTC_CTL_DSM));
    RTC_CTL |= (uint32_t)(operation | record);

    /* enable the write protection */
    RTC_WPK = RTC_LOCK_KEY;
}

/*!
    \brief      reset most of the RTC registers
    \param[in]  none
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus hals_rtc_deinit(void)
{
    ErrStatus error_status = ERROR;

    /* RTC_TAMP register is not under write protection */
    RTC_TAMP = RTC_REGISTER_RESET;

    /* disable the write protection */
    RTC_WPK = RTC_UNLOCK_KEY1;
    RTC_WPK = RTC_UNLOCK_KEY2;

    /* reset RTC_CTL register, this can be done without the init mode */
    RTC_CTL &= RTC_REGISTER_RESET;

    /* enter init mode */
    error_status = hals_rtc_init_mode_enter();

    if(ERROR != error_status) {
        /* before reset RTC_TIME and RTC_DATE, BPSHAD bit in RTC_CTL should be reset as the condition.
           in order to read calendar from shadow register, not the real registers being reset */
        RTC_TIME = RTC_REGISTER_RESET;
        RTC_DATE = RTC_DATE_RESET;

